app/interactors/create_url.rb

INSERT INTO "urls" ("created_at", "updated_at", "short_url", "original_url") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2022-03-21 22:29:57.986212"], ["updated_at", "2022-03-21 22:29:57.986212"], ["short_url", "temp"], ["original_url", "https://www.youtube.com/"]]
---
  def call
    context.url = Url.create!(original_url: context.original_url, short_url: 'temp')