app/interactors/visit_url.rb

  def call
    context.url = Url.find_by!(short_url: context.short_url)
---
SELECT "urls".* FROM "urls" WHERE "urls"."short_url" = $1 LIMIT $2  [["short_url", "K"], ["LIMIT", 1]]