app/models/url.rb

  def perform_click(browser_name, platform_name)
    Click.create!(browser: browser_name, platform: platform_name, url_id: id)
---
INSERT INTO "clicks" ("created_at", "updated_at", "url_id", "browser", "platform") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2022-03-21 05:17:14.114693"], ["updated_at", "2022-03-21 05:17:14.114693"], ["url_id", 10], ["browser", "Firefox"], ["platform", "Generic Linux"]]